Revit 2026 API

# ConduitSizeSettingIteratorCurrent Property

---

Gets the item at the current position of the iterator.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual KeyValuePair<string, ConduitSizes> Current { get; }
```
```vb
Public Overridable ReadOnly Property Current As KeyValuePair(Of String, ConduitSizes)
	Get
```
```cpp
public:
virtual property KeyValuePair<String^, ConduitSizes^> Current {
	KeyValuePair<String^, ConduitSizes^> get ();
}
```
```fsharp
abstract Current : KeyValuePair<string, ConduitSizes> with get
override Current : KeyValuePair<string, ConduitSizes> with get
```

#### Property Value

KeyValuePairString, ConduitSizes

#### Implements

IEnumeratorTCurrent

| Exception | Condition |
| --- | --- |
| InvalidOperationException | There is no current item in the iterator. |

There is no current item if the iterator has not started yet or has been done.

#### Reference

ConduitSizeSettingIterator Class

Autodesk.Revit.DB.Electrical Namespace